newwms_gift/src/Documents/итWMSПроверка/итWMSПроверка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>итWMSПроверка</name>
  <basedOn>Document.итWMSНаборка</basedOn>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>EnumRef.итWMSСтатусыСкладскихДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СнимокТабличнойЧастиДоРаспределения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершенияДокумента</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НеРаспределятьНаТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СозданНаОснованиСерверногоВызова</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторУпаковки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>172</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Качество</name>
      <type>
        <types>CatalogRef.Качество</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРозлива</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>CatalogRef.итСкладскиеЯчейки</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеЗадачи</name>
      <type>
        <types>EnumRef.итWMSСостоянияЗадачТСД</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонтрольБутылки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>172</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонтрольКороба</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>172</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФиксацияСтроки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаОтменыЗадачи</name>
      <type>
        <types>CatalogRef.итWMS_ПричиныОтменыЗадач</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>итОснования</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.ЗаказПокупателя</types>
        <types>DocumentRef.итWMSНаборка</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

newwms_gift/src/InformationRegisters/итWMSСтрокиЗадачТСД/итWMSСтрокиЗадачТСД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>итWMSСтрокиЗадачТСД</name>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>ДатаРозлива</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СерияНоменклатуры</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДополнительныеДанные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>ДанныеДокументаТСД</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <dimensions>
    <name>ИдЗадачи</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>идСтроки</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

newwms_gift/src/InformationRegisters/итWMS_МаркиВОбработке/итWMS_МаркиВОбработке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>итWMS_МаркиВОбработке</name>
  <attributes>
    <name>Ключ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйКлюч</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Марка</name>
    <type>
      <types>CatalogRef.Марки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.итWMSКонтрольнаяОперацияАгрегации</types>
      <types>DocumentRef.итWMSПроверка</types>
      <types>DocumentRef.итWMSНаборка</types>
      <types>String</types>
      <types>DocumentRef.итWMSПеремещение</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

newwms_gift/src/Enums/итWMSСтатусыСкладскихДокументов/итWMSСтатусыСкладскихДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>итWMSСтатусыСкладскихДокументов</name>
  <enumValues>
    <name>Создан</name>
  </enumValues>
  <enumValues>
    <name>Зарезервирован</name>
  </enumValues>
  <enumValues>
    <name>Распределяется</name>
  </enumValues>
  <enumValues>
    <name>Распределен</name>
  </enumValues>
  <enumValues>
    <name>Выполнен</name>
  </enumValues>
  <enumValues>
    <name>ВыполненСОшибкой</name>
  </enumValues>
  <enumValues>
    <name>Завершен</name>
  </enumValues>
</mdclass:Enum>

newwms_gift/src/Enums/итWMSСостоянияЗадачТСД/итWMSСостоянияЗадачТСД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>итWMSСостоянияЗадачТСД</name>
  <enumValues>
    <name>КВыполнению</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетРазрешения</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
  <enumValues>
    <name>Выполнена</name>
  </enumValues>
  <enumValues>
    <name>Выполняется</name>
  </enumValues>
</mdclass:Enum>

newwms_gift/src/Documents/итWMSНаборка/итWMSНаборка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>итWMSНаборка</name>
  <basedOn>Document.ЗаказПокупателя</basedOn>
  <basedOn>Document.СписаниеТоваров</basedOn>
  <basedOn>Document.ВнутреннийЗаказ</basedOn>
  <registerRecords>AccumulationRegister.итТоварыВЯчейках</registerRecords>
  <attributes>
    <name>итОснование</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
      <types>DocumentRef.итWMSПриемка</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>EnumRef.итWMSСтатусыСкладскихДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СнимокТабличнойЧастиДоРаспределения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершенияДокумента</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НеРаспределятьНаТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПозицийНоменклатурыНаПаллете</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПозицийСерииНаПаллете</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РезервироватьЯчейкиЭстокады</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СозданНаОснованиСерверногоВызова</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимРезервированияБезПеремещения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Проверил</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ИгнорироватьОшибкиСерии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимТестирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторУпаковки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>172</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Качество</name>
      <type>
        <types>CatalogRef.Качество</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРозлива</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЯчейкаОтправитель</name>
      <type>
        <types>CatalogRef.итСкладскиеЯчейки</types>
      </type>
    </attributes>
    <attributes>
      <name>ЯчейкаПикинга</name>
      <type>
        <types>CatalogRef.итСкладскиеЯчейки</types>
      </type>
    </attributes>
    <attributes>
      <name>ЯчейкаПолучатель</name>
      <type>
        <types>CatalogRef.итСкладскиеЯчейки</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеЗадачи</name>
      <type>
        <types>EnumRef.итWMSСостоянияЗадачТСД</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторУпаковкиПолучатель</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>172</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаОтменыЗадачи</name>
      <type>
        <types>CatalogRef.итWMS_ПричиныОтменыЗадач</types>
      </type>
    </attributes>
    <attributes>
      <name>ФиксацияСтроки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИзъятиеТовара</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоИзъятия</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИсполнения</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

newwms_gift/src/Documents/итWMSПроверка/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.СтатусДокумента=Перечисления.итWMSСтатусыСкладскихДокументов.Распределен Тогда
		ОбновитьДанныеСТСД();
	КонецЕсли;
	Если Параметры.Ключ.Пустая() тогда
		Объект.НеРаспределятьНаТСД=Истина;
		Если не Объект.СозданНаОснованиСерверногоВызова тогда
			Для Каждого стр из Объект.итОснования  Цикл 
				стр.Документ=Неопределено;
			КонецЦикла;
		иначе
			Объект.СозданНаОснованиСерверногоВызова=Ложь;
		КонецЕсли;
		Объект.Дата=ТекущаяДата();
        Объект.СтатусДокумента=Перечисления.итWMSСтатусыСкладскихДокументов.Создан;
        Объект.Ответственный=ПараметрыСеанса.ТекущийПользователь;

	КонецЕсли;
	   ВидимостьДоступностьЭлементовСервер();
КонецПроцедуры



#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
Процедура ДобавитьТовары(Команда)
	Если  Элементы.ГруппаТовары.ТолькоПросмотр тогда
		Возврат
	КонецЕсли;	
	НоваяСтрока=Объект.Товары.Добавить();
	НоваяСтрока.ИдентификаторСтроки=новый УникальныйИдентификатор;
	НоваяСтрока.ИдентификаторСтрокиПредставление= Строка(НоваяСтрока.ИдентификаторСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьТовары(Команда)
	Если  Элементы.ГруппаТовары.ТолькоПросмотр тогда
		Возврат
	КонецЕсли;	
	Если ТекущийЭлемент.Имя="Товары" тогда
		НоваяСтрока=Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,ТекущийЭлемент.ТекущиеДанные);
		НоваяСтрока.ИдентификаторСтроки=новый УникальныйИдентификатор;
		НоваяСтрока.ИдентификаторСтрокиПредставление=Строка(НоваяСтрока.ИдентификаторСтроки);
		НоваяСтрока.Количество=0;
		НоваяСтрока.КоличествоФакт=0;
		НоваяСтрока.ЯчейкаПикинга=ПустаяЯчейка();
		НоваяСтрока.ЯчейкаОтправитель=ПустаяЯчейка();
		НоваяСтрока.ЯчейкаПолучатель=ПустаяЯчейка();
		НоваяСтрока.ФиксацияСтроки=Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПросмотрЗначения(Команда)
	Если ТекущийЭлемент.Имя="Товары" Тогда
		Если ТипЗнч(ТекущийЭлемент.ТекущийЭлемент)=Тип("ПолеФормы") Тогда
			ИмяПоля=ТекущийЭлемент.ТекущийЭлемент.Имя;
			ДлинаСтроки=СтрДлина(ИмяПоля);
			ДлинаТовары=СтрДлина("Товары");
			ПутьКДанным=Прав(ИмяПоля,ДлинаСтроки-ДлинаТовары);
		//	#Если не ВебКлиент Тогда
		//	ОткрытьЗначение(ТекущийЭлемент.ТекущиеДанные[ПутьКДанным]);
		//#КонецЕсли	
		ПоказатьЗначение(,ТекущийЭлемент.ТекущиеДанные[ПутьКДанным]);
		КонецЕсли;
	КонецЕсли;  
	КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	Если Объект.Ссылка.Пустая() Тогда 
		Сообщить("запишите документ");
		Возврат
	КонецЕсли;
	ТабличныйДокумент= ПечатьНаСервере();
	ТабличныйДокумент.Показать();
КонецПроцедуры
&НаСервере
Функция ПечатьНаСервере()
	ТабличныйДокумент=новый ТабличныйДокумент;
	Документы.итWMSПроверка.СформироватьПечатнуюФорму(Объект.Ссылка,ТабличныйДокумент);
	Если ТабличныйДокумент.НайтиТекст("{ШаблонСотрудника}") <> Неопределено Тогда  
			Область=ТабличныйДокумент.НайтиТекст("{ШаблонСотрудника}");
			Область.Текст=СтрЗаменить(Область.Текст,"{ШаблонСотрудника}","");
	КонецЕсли;
	Возврат ТабличныйДокумент;
КонецФункции

&НаСервере
Процедура СверкаСОснованиемНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЧ.ИдентификаторУпаковки,
		|	ТЧ.Номенклатура,
		|	ТЧ.Характеристика,
		|	ТЧ.СерияНоменклатуры,
		|	ТЧ.Качество,
		|	ТЧ.ДатаРозлива,
		|	ТЧ.Ячейка,
		|	ТЧ.ФиксацияСтроки,
		|	ТЧ.СостояниеЗадачи,
		|	ТЧ.КоличествоФакт КАК КоличествоФакт
		|ПОМЕСТИТЬ ДанныеТоваровПроверки
		|ИЗ
		|	&Товары КАК ТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	итWMSНаборкаТовары.ИдентификаторУпаковкиПолучатель КАК ИдентификаторУпаковки,
		|	итWMSНаборкаТовары.Номенклатура,
		|	итWMSНаборкаТовары.Характеристика,
		|	итWMSНаборкаТовары.СерияНоменклатуры,
		|	итWMSНаборкаТовары.Качество,
		|	итWMSНаборкаТовары.ДатаРозлива,
		|	СУММА(ВЫБОР
		|			КОГДА итWMSНаборкаТовары.ИзъятиеТовара
		|				ТОГДА итWMSНаборкаТовары.КоличествоФакт - итWMSНаборкаТовары.КоличествоИзъятия
		|			ИНАЧЕ итWMSНаборкаТовары.КоличествоФакт
		|		КОНЕЦ) КАК Количество,
		|	итWMSНаборкаТовары.ЯчейкаПолучатель КАК Ячейка
		|ПОМЕСТИТЬ Вт
		|ИЗ
		|	Документ.итWMSНаборка.Товары КАК итWMSНаборкаТовары
		|ГДЕ
		|	итWMSНаборкаТовары.ФиксацияСтроки
		|	И итWMSНаборкаТовары.Ссылка В(&Наборка)
		|	И итWMSНаборкаТовары.СостояниеЗадачи = ЗНАЧЕНИЕ(Перечисление.итWMSСостояниязадачТСД.Выполнена)
		|
		|СГРУППИРОВАТЬ ПО
		|	итWMSНаборкаТовары.ИдентификаторУпаковкиПолучатель,
		|	итWMSНаборкаТовары.Номенклатура,
		|	итWMSНаборкаТовары.Характеристика,
		|	итWMSНаборкаТовары.СерияНоменклатуры,
		|	итWMSНаборкаТовары.Качество,
		|	итWMSНаборкаТовары.ДатаРозлива,
		|	итWMSНаборкаТовары.ЯчейкаПолучатель
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Вт.ИдентификаторУпаковки,
		|	Вт.Номенклатура,
		|	Вт.Характеристика,
		|	Вт.СерияНоменклатуры,
		|	Вт.Качество,
		|	Вт.ДатаРозлива,
		|	Вт.Количество,
		|	Вт.Ячейка
		|ПОМЕСТИТЬ ВтДанныеНаборки
		|ИЗ
		|	Вт КАК Вт
		|ГДЕ
		|	Вт.Количество > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеТоваровПроверки.ИдентификаторУпаковки,
		|	ДанныеТоваровПроверки.Номенклатура,
		|	ДанныеТоваровПроверки.Характеристика,
		|	ДанныеТоваровПроверки.СерияНоменклатуры,
		|	ДанныеТоваровПроверки.Качество,
		|	ДанныеТоваровПроверки.ДатаРозлива,
		|	ДанныеТоваровПроверки.Ячейка,
		|	СУММА(ДанныеТоваровПроверки.КоличествоФакт) КАК Количество
		|ПОМЕСТИТЬ ДанныеПроверки
		|ИЗ
		|	ДанныеТоваровПроверки КАК ДанныеТоваровПроверки
		|ГДЕ
		|	ДанныеТоваровПроверки.ФиксацияСтроки
		|	И ДанныеТоваровПроверки.СостояниеЗадачи = ЗНАЧЕНИЕ(Перечисление.итWMSСостояниязадачТСД.Выполнена)
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеТоваровПроверки.ИдентификаторУпаковки,
		|	ДанныеТоваровПроверки.Номенклатура,
		|	ДанныеТоваровПроверки.Характеристика,
		|	ДанныеТоваровПроверки.СерияНоменклатуры,
		|	ДанныеТоваровПроверки.Качество,
		|	ДанныеТоваровПроверки.ДатаРозлива,
		|	ДанныеТоваровПроверки.Ячейка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВтДанныеНаборки.ИдентификаторУпаковки,
		|	ВтДанныеНаборки.Номенклатура,
		|	ВтДанныеНаборки.Характеристика,
		|	ВтДанныеНаборки.СерияНоменклатуры,
		|	ВтДанныеНаборки.Качество,
		|	ВтДанныеНаборки.ДатаРозлива,
		|	ВтДанныеНаборки.Количество КАК КоличествоНаборки,
		|	ВтДанныеНаборки.Ячейка,
		|	ЕСТЬNULL(ДанныеПроверки.Количество, 0) КАК КоличествоПроверки,
		|	ВтДанныеНаборки.Количество - ЕСТЬNULL(ДанныеПроверки.Количество, 0) КАК КоличествоКДобавлению
		|ИЗ
		|	ВтДанныеНаборки КАК ВтДанныеНаборки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеПроверки КАК ДанныеПроверки
		|		ПО ВтДанныеНаборки.ИдентификаторУпаковки = ДанныеПроверки.ИдентификаторУпаковки
		|			И ВтДанныеНаборки.Номенклатура = ДанныеПроверки.Номенклатура
		|			И ВтДанныеНаборки.Характеристика = ДанныеПроверки.Характеристика
		|			И ВтДанныеНаборки.СерияНоменклатуры = ДанныеПроверки.СерияНоменклатуры
		|			И ВтДанныеНаборки.Качество = ДанныеПроверки.Качество
		|			И ВтДанныеНаборки.ДатаРозлива = ДанныеПроверки.ДатаРозлива
		|			И ВтДанныеНаборки.Ячейка = ДанныеПроверки.Ячейка
		|ГДЕ
		|	ВтДанныеНаборки.Количество <> ЕСТЬNULL(ДанныеПроверки.Количество, 0)";
	
	Запрос.УстановитьПараметр("Наборка", Объект.итОснования.Выгрузить().ВыгрузитьКолонку("Документ"));
	Запрос.УстановитьПараметр("Товары", Объект.Товары.Выгрузить());
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда 
		Данные=РеквизитФормыВЗначение("Объект");
		Данные.ДействияПриФиксацииЗадачДокумента();
		ЗначениеВРеквизитФормы(Данные,"Объект");
		ВидимостьДоступностьЭлементовСервер();
		Возврат;
	КонецЕсли;
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ОбъектДокумента=Объект.Ссылка.ПолучитьОбъект();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.КоличествоКДобавлению<0 Тогда 
			ЗначениеВРеквизитФормы(ОбъектДокумента,"Объект");
			Сообщить("КоличествоКДобавлению меньше 0, проверьте наборку");
		КонецЕсли;	
		Если НаличиеНеОтмененногоТекущегоИдентификатораВПроверке(ВыборкаДетальныеЗаписи.ИдентификаторУпаковки) Тогда 
			 ЗначениеВРеквизитФормы(ОбъектДокумента,"Объект");
			 Сообщить("В идентификатор "+ВыборкаДетальныеЗаписи.ИдентификаторУпаковки +" внесены изменения, пожалуйста в начале отмени задачу данной паллеты , до начала сверки с основанием");
		КонецЕсли;	
		НоваяСтрока=Объект.Товары.Добавить();
		НоваяСтрока.ИдентификаторСтроки=новый УникальныйИдентификатор;
		НоваяСтрока.ИдентификаторУпаковки=ВыборкаДетальныеЗаписи.ИдентификаторУпаковки;
		НоваяСтрока.Номенклатура=ВыборкаДетальныеЗаписи.Номенклатура;
		НоваяСтрока.Характеристика=ВыборкаДетальныеЗаписи.Характеристика;
		НоваяСтрока.СерияНоменклатуры=ВыборкаДетальныеЗаписи.СерияНоменклатуры;
		НоваяСтрока.Качество=ВыборкаДетальныеЗаписи.Качество;
        НоваяСтрока.ДатаРозлива=ВыборкаДетальныеЗаписи.ДатаРозлива;
	    НоваяСтрока.Ячейка=ВыборкаДетальныеЗаписи.Ячейка;
	    НоваяСтрока.Количество=ВыборкаДетальныеЗаписи.КоличествоКДобавлению;
	КонецЦикла;

КонецПроцедуры


&НаКлиенте
Процедура СверкаСОснованием(Команда)
	СверкаСОснованиемНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьЗадачу(Команда)
	Оповещение=новый ОписаниеОповещения("ОтменитьЗадачуОповещение",ЭтаФорма);
	ПоказатьВопрос(Оповещение,"Предупреждение!!!Вы отмените результат всего паллета, а не конкретной строчки,данные марок так же будут удалены.
	|Вы точно хотите отменить задачу? ",РежимДиалогаВопрос.ДаНет);
КонецПроцедуры
&НаКлиенте
Процедура ОтменитьЗадачуОповещение(Результат,Параметры) Экспорт 
	Если Результат=КодВозвратаДиалога.Нет Тогда 
		Возврат
	КонецЕсли;
	Строка=Элементы.Товары.ТекущиеДанные.ИдентификаторСтроки;
	ОтменитьЗадачуСервер(Строка);
КонецПроцедуры

&НаСервере
Процедура ОтменитьЗадачуСервер(Строка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	итWMSСтрокиЗадачТСД.ИдЗадачи
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	РегистрСведений.итWMSСтрокиЗадачТСД КАК итWMSСтрокиЗадачТСД
		|ГДЕ
		|	итWMSСтрокиЗадачТСД.идСтроки = &идСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	итWMSСтрокиЗадачТСД.идСтроки
		|ИЗ
		|	ВТ КАК ВТ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.итWMSСтрокиЗадачТСД КАК итWMSСтрокиЗадачТСД
		|		ПО ВТ.ИдЗадачи = итWMSСтрокиЗадачТСД.ИдЗадачи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.ИдЗадачи
		|ИЗ
		|	ВТ КАК ВТ";
	
	Запрос.УстановитьПараметр("идСтроки", Строка);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	Отменена=Перечисления.итWMSСостоянияЗадачТСД.Отменена;
	ВыборкаСтрок= РезультатЗапроса[1].Выбрать();
	Пока ВыборкаСтрок.Следующий() Цикл
		Строки=Объект.Товары.НайтиСтроки(новый Структура("ИдентификаторСтроки",ВыборкаСтрок.идСтроки));
		Для Каждого стр из Строки Цикл 
			стр.СостояниеЗадачи=Отменена;
		КонецЦикла;
	КонецЦикла;
	Данные=РеквизитФормыВЗначение("Объект");
	Данные.ДействияПриФиксацииЗадачДокумента();
	Данные.Записать();
	ЗначениеВРеквизитФормы(Данные,"Объект");
	ВидимостьДоступностьЭлементовСервер();
	ВыборкаЗадач = РезультатЗапроса[2].Выбрать();
	
	Пока ВыборкаЗадач.Следующий() Цикл
		 ОчиститьДанныеМарок(Объект.Ссылка,ВыборкаЗадач.ИдЗадачи);
	КонецЦикла;

КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ОбновитьДанныеСТСД()
Документы.итWMSПроверка.ВнестиИзменениеДанныхТСДВДокумент(Объект.Ссылка);
Данные=Объект.Ссылка.ПолучитьОбъект();
Если итWMSСлужебныеПроцедурыИФункции.ВсеЗадачиДокументаЗафиксированны(Объект.Ссылка) Тогда
	Данные.ДействияПриФиксацииЗадачДокумента();
	Данные.ОбменДанными.Загрузка=Истина;
	//Данные.ОтложенноеПроведение=Истина;
	Данные.Записать();
	итWMSСлужебныеПроцедурыИФункции.СделатьЗаписьДопОбработкиОтложенногоПроведения(Данные.Ссылка);
КонецЕсли;
ЗначениеВРеквизитФормы(Данные,"Объект");
КонецПроцедуры

&НаСервере
Процедура ВидимостьДоступностьЭлементовСервер()
	Если Объект.СтатусДокумента=Перечисления.итWMSСтатусыСкладскихДокументов.ВыполненСОшибкой
	или Объект.СтатусДокумента=Перечисления.итWMSСтатусыСкладскихДокументов.Выполнен
		Тогда 
		Элементы.ТоварыКонтекстноеМенюОтменитьЗадачу.Видимость=Истина;
		Элементы.ФормаСверкаСОснованием.Видимость=Истина;
	иначе
		Элементы.ТоварыКонтекстноеМенюОтменитьЗадачу.Видимость=Ложь;
		Элементы.ФормаСверкаСОснованием.Видимость=Ложь;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ОчиститьДанныеМарок(Ссылка,ИдЗадачи)	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	итWMS_МаркиВОбработке.Марка,
		|	итWMS_МаркиВОбработке.ДокументОснование,
		|	итWMS_МаркиВОбработке.Ключ
		|ИЗ
		|	РегистрСведений.итWMS_МаркиВОбработке КАК итWMS_МаркиВОбработке
		|ГДЕ
		|	итWMS_МаркиВОбработке.ДокументОснование = &ДокументОснование
		|	И итWMS_МаркиВОбработке.Ключ = &Ключ";
	
	Запрос.УстановитьПараметр("ДокументОснование", Ссылка);
	Запрос.УстановитьПараметр("Ключ", ИдЗадачи);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НаборЗаписей=РегистрыСведений.итWMS_МаркиВОбработке.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Марка.Установить(ВыборкаДетальныеЗаписи.Марка);
		НаборЗаписей.Отбор.ДокументОснование.Установить(ВыборкаДетальныеЗаписи.ДокументОснование);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		НаборЗаписей.Записать();
	КонецЦикла;
		
КонецПроцедуры
&НаСервере
Функция НаличиеНеОтмененногоТекущегоИдентификатораВПроверке(Идентификатор)
	Строки=Объект.Товары.НайтиСтроки(новый Структура("ИдентификаторУпаковки",Идентификатор));
	Отменена=Перечисления.итWMSСостоянияЗадачТСД.Отменена;
	Для Каждого стр из Строки Цикл 
		Если стр.ФиксацияСтроки и стр.СостояниеЗадачи<>Отменена Тогда 
			Возврат Истина;
		КонецЕсли;	
	КонецЦикла;
	Возврат Ложь;
	КонецФункции
&НаСервереБезКонтекста
Функция ПустаяЯчейка()
	Возврат Справочники.итСкладскиеЯчейки.ПустаяСсылка();
КонецФункции

&НаСервере
Процедура ПечатьШкВПаллетахНаСервере(ТабличныйДокумент)
	Данные=РеквизитФормыВЗначение("Объект");
	Данные.ПечатьШкВПаллете(ТабличныйДокумент);
КонецПроцедуры

&НаКлиенте
Процедура ПечатьШкВПаллетах(Команда)
	ТабличныйДокумент=новый ТабличныйДокумент;
	ПечатьШкВПаллетахНаСервере(ТабличныйДокумент);
	ТабличныйДокумент.Показать();
КонецПроцедуры
#КонецОбласти

#Область ГИФТ
#КонецОбласти
